// --------------------------------------------------------
//	IB_Script.hpp
// --------------------------------------------------------
//	Luaスクリプト処理関連のクラスを記載する．
// --------------------------------------------------------
//	一度だけ読み込む
#pragma once

// --------------------------------------------------------
//	必要なヘッダーを読み込む
// --------------------------------------------------------
extern "C"{
	#include "Lua/include/lua.h"
}
#include "Lua/luabind/luabind.hpp"

// --------------------------------------------------------
//	名前空間を使用(IB_Base::Script)
// --------------------------------------------------------
namespace IB_Base
{
	namespace Script
	{
		/// <summary>
		///		Luaスクリプトを実行する関数群をまとめたクラス。
		/// </summary>
		class LuaScript
		{
		public:
			LuaScript();

		private:


		};
	}
}